Documents/Талоны.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>Талоны</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.КоличествоЛьготВыдано</xr:Item>
				<xr:Item>InformationRegister.ТалоныНаЛьготы</xr:Item>
				<xr:Item>AccumulationRegister.КоличествоЛьготПоКатегориям</xr:Item>
				<xr:Item>InformationRegister.НумирацияТалонов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДолжностьДляРосписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникДляРосписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СельскийСовет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СельскиеСоветы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЛьготы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЛьгот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВедомости</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТалоныТЧ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заявитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресДомовладельца</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусПолучателя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛьготныеКатегории</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаОтпуска</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПолучателя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодДействияТалона</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыдачи</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СельскийСовет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СельскиеСоветы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтпускаУгля</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛьготныеКатегории</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОснование</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЛичноеДело</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыдачиЗаявителю</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредметЛьготы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПредметЛьготы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕденицыИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕденицыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КомплектностьДокумента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подстановка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Информация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛьготныеКатегории</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИнформацияПоВыдаче</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛьготныеКатегории</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыдачиЗаявителю</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Информация1</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛьготныеКатегории</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредметЛьготы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПредметЛьготы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Информация2</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПредметЛьготы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПредметЛьготы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Талоны/Forms/ПечатьТалонов/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ВернутьДанныеИзДокТалоны(ЭлементыПодстановки,ВидЛьготы,ПериодНачало, ПериодОкончания)
	 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТалоныТалоныТЧ.ДокументОснование КАК ДокументОснование,
		|	ТалоныТалоныТЧ.Заявитель КАК Заявитель,
		|	ТалоныТалоныТЧ.Ссылка КАК Ведомость,
		|	ТалоныТалоныТЧ.Номер КАК НомерТалона,
		|	ТалоныТалоныТЧ.ДатаВыдачи КАК ДатаВыдачиТалона,
		|	ТалоныТалоныТЧ.АдресДомовладельца КАК АдресДомовладельца,
		|	ТалоныТалоныТЧ.Категория КАК Категория,
		|	ТалоныТалоныТЧ.НомерПолучателя КАК НомерПолучателя,
		|	ТалоныТалоныТЧ.ПредметЛьготы КАК ПредметЛьготы,
		|	ТалоныТалоныТЧ.НормаОтпуска КАК НормаОтпуска,
		|	ТалоныТалоныТЧ.ПериодДействияТалона КАК ПериодДействияТалона,
		|	ТалоныТалоныТЧ.Ссылка.Организация КАК Организация,
		|	ТалоныТалоныТЧ.ЕденицыИзмерения КАК ЕденицыИзмерения,
		|	ТалоныТалоныТЧ.СельскийСовет КАК СельскийСовет
		|ИЗ
		|	Документ.Талоны.ТалоныТЧ КАК ТалоныТалоныТЧ
		|ГДЕ
		|	ТалоныТалоныТЧ.ДатаВыдачи МЕЖДУ &ДатаВыдачи1 И &ДатаВыдачи2
		|	И ТалоныТалоныТЧ.Ссылка.ВидЛьготы = &ВидЛьготы
		|	И ТалоныТалоныТЧ.ДокументОснование В(&ДокументОснование)";
	
	Запрос.УстановитьПараметр("ВидЛьготы", ВидЛьготы);
	Запрос.УстановитьПараметр("ДатаВыдачи1", ПериодНачало);
	Запрос.УстановитьПараметр("ДатаВыдачи2", ПериодОкончания);
	Запрос.УстановитьПараметр("ДокументОснование", ЭлементыПодстановки);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ТЗ);

	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецФункции	

&НаСервере
Функция ЛичноеДелоВырнутьЗаявителя(ВыбранныйЭлемент)
	Возврат   ВыбранныйЭлемент.Заявитель;
КонецФункции

&НаКлиенте
Процедура ПодборЛД(Команда)
	ПараметрыФормы = Новый Структура("МножественныйВыбор", Истина);
	ОткрытьФорму("Документ.ЛичноеДело.ФормаВыбора",ПараметрыФормы,Элементы.ТаблицаДляЗаполнения);
КонецПроцедуры

&НаСервере
Процедура ВидЛьготыПриИзмененииНаСервере()
	ПериодНачало = ВидЛьготы.ДатаНачала;
	ПериодОкончания = ВидЛьготы.ДатаОкончания;
КонецПроцедуры


&НаКлиенте
Процедура ВидЛьготыПриИзменении(Элемент)
	ВидЛьготыПриИзмененииНаСервере();
КонецПроцедуры



&НаКлиенте
Процедура ТаблицаДляЗаполненияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	МассивДляВыбора  = Новый Массив;
	
	
	
	Для Каждого ВыбранныйЭлемент Из ВыбранноеЗначение Цикл
		  МассивДляВыбора.Добавить(ВыбранныйЭлемент);
	КонецЦикла;
	
	МассивВыбора = ВернутьДанныеИзДокТалоны(МассивДляВыбора,ВидЛьготы,ПериодНачало, ПериодОкончания);

	Для Каждого ЭлементМассива из МассивВыбора Цикл
			НС = ТаблицаДляЗаполнения.Добавить();
			НС.ДокументОснование 			= ЭлементМассива.ДокументОснование; 
			НС.Заявитель         			= ЭлементМассива.Заявитель;
			НС.Ведомость         			= ЭлементМассива.Ведомость;
			НС.НомерТалона       			= ЭлементМассива.НомерТалона;
			НС.ДатаВыдачиТалона  			= ЭлементМассива.ДатаВыдачиТалона;
			НС.АдресДомовладельца           = ЭлементМассива.АдресДомовладельца;
			НС.Категория                    = ЭлементМассива.Категория;
			НС.НомерПолучателя              = ЭлементМассива.НомерПолучателя;
			НС.НормаОтпуска                 = ЭлементМассива.НормаОтпуска;
			НС.ПериодДействияТалона         = ЭлементМассива.ПериодДействияТалона;
			НС.Организация                  = ЭлементМассива.Организация;
			НС.ЕденицыИзмерения             = ЭлементМассива.ЕденицыИзмерения;
			НС.СельскийСовет                = ЭлементМассива.СельскийСовет;
			НС.ПредметЛьготы                = ЭлементМассива.ПредметЛьготы;
			
	КонецЦикла;	
	
	

	  
КонецПроцедуры

// Печать////
&НаСервере
Функция ПечатьТалоновНаСервере()
	ТабДок = Новый ТабличныйДокумент;
	Макет = Документы.Талоны.ПолучитьМакет("ПФ_MXL_МакетТалоныГоризонталь");
	ПервыйДокумент = Истина;
	Если Не ПервыйДокумент Тогда
            // Все документы нужно выводить на разных страницах.
            ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
    КонецЕсли;
    ПервыйДокумент = Ложь;
    // Запомним номер строки, с которой начали выводить текущий документ.
        НомерСтрокиНачало = ТабДок.ВысотаТаблицы + 1;
		КолТалоновНаЛисте = 1;
		КолНаЛисте = 1;

	Для Каждого СтрокаТЧ из ТаблицаДляЗаполнения Цикл
		   Если КолНаЛисте = 7 Тогда 
				 КолНаЛисте =1;
				 ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			Область = Макет.ПолучитьОбласть("Талон|Горизонталь");
			Область.Параметры.Заявитель = СтрокаТЧ.Заявитель;
		    Область.Параметры.Номер   =  СтрокаТЧ.НомерТалона;
			Область.Параметры.АдресДомовладельца  = СтрокаТЧ.АдресДомовладельца;                        
			Область.Параметры.СтатусПолучателя = СтрокаТЧ.Категория;
		    Область.Параметры.НомерПолучателя  = СтрокаТЧ.НомерПолучателя;
			Область.Параметры.ПредметЛьготы   = СтрокаТЧ.ПредметЛьготы;
			Область.Параметры.НормаОтпуска  = СтрокаТЧ.НормаОтпуска;
			Область.Параметры.ЕденицаИзмерения  = СтрокаТЧ.ЕденицыИзмерения;
			Область.Параметры.ДатаВыдачи    =Формат(СтрокаТЧ.ДатаВыдачиТалона,"ДФ=dd.MM.yyyy; ДЛФ=DD");
			Область.Параметры.ПериодДействияТалона  = Формат(СтрокаТЧ.ПериодДействияТалона,"ДФ=dd.MM.yyyy; ДЛФ=DD");
			//Область.Параметры.ДатаОтпускаУгля  = Формат(СтрокаТЧ.ДатаОтпускаУгля,"ДФ=dd.MM.yyyy; ДЛФ=DD");
		    Область.Параметры.ЗаявительИнициалы = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(СтрокаТЧ.Заявитель);
			ТекущийНачальник = ПараметрыСеанса.ТекущийНачальникУправления;
		    Область.Параметры.СотрудникДляРосписиИнициалы  = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ТекущийНачальник); 
			Область.Параметры.ДолжностьДляРосписи  =  ТекущийНачальник.Должность;
			Область.Параметры.Организация   =  СтрокаТЧ.Организация.ПолноеНаименование;
			Если КолТалоновНаЛисте > 3 Тогда
				ТабДок.ВывестиВертикальныйРазделительСтраниц();
				ТабДок.Вывести(Область);
				КолТалоновНаЛисте = 1;
				
			Иначе
				ТабДок.Присоединить(Область);
			КонецЕсли;	
			КолТалоновНаЛисте = КолТалоновНаЛисте +1;
			КолНаЛисте = КолНаЛисте+1;	

	КонецЦикла;	
	//Конец вывода документа
		ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		ТабДок.АвтоМасштаб=Истина;

	
    Возврат ТабДок;
КонецФункции


&НаКлиенте
Процедура ПечатьТалонов(Команда)
	ТабДок = ПечатьТалоновНаСервере();
	ТабДок.Показать("печать талонов");
КонецПроцедуры

&НаСервере
Функция  ПечатьВедомостиНаСервере()
	ТабДок = Новый ТабличныйДокумент;
	Макет = Документы.Талоны.ПолучитьМакет("ПФ_MXL_РеестрТалоны");
		Запрос = Новый Запрос;
	
	Если ЗначениеЗаполнено(СельскийСовет) Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТалоныТалоныТЧ.НомерСтроки КАК НомерСтроки,
		|	ТалоныТалоныТЧ.Заявитель КАК Заявитель,
		|	ТалоныТалоныТЧ.АдресДомовладельца КАК АдресДомовладельца,
		|	ТалоныТалоныТЧ.Номер КАК Номер,
		|	ТалоныТалоныТЧ.ДатаВыдачи КАК ДатаВыдачи,
		|	ТалоныТалоныТЧ.Категория КАК Категория,
		|	ТалоныТалоныТЧ.Заявитель.ДатаРождения КАК ЗаявительДатаРождения,
		|	ТалоныТалоныТЧ.Заявитель.ПаспортСерия + ТалоныТалоныТЧ.Заявитель.ПаспортНомер КАК ПаспортныеДанные,
		|	ТалоныТалоныТЧ.Заявитель.ИНН КАК ЗаявительИНН,
		|	"""" КАК ДатаПолучения,
		|	"""" КАК ПодписьЗаявителя
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ТалоныТЧ КАК ТалоныТалоныТЧ
		|ГДЕ
		|	ТалоныТалоныТЧ.СельскийСовет = &СельскийСовет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.НомерСтроки КАК НомерСтроки,
		|	ВТ.Заявитель КАК Заявитель,
		|	ВТ.АдресДомовладельца КАК АдресДомовладельца,
		|	ВТ.Номер КАК Номер,
		|	ВТ.ДатаВыдачи КАК ДатаВыдачи,
		|	ВТ.Категория КАК Категория,
		|	ВТ.ЗаявительДатаРождения КАК ЗаявительДатаРождения,
		|	ВТ.ПаспортныеДанные КАК ПаспортныеДанные,
		|	ВТ.ЗаявительИНН КАК ЗаявительИНН,
		|	ВТ.ДатаПолучения КАК ДатаПолучения,
		|	ВТ.ПодписьЗаявителя КАК ПодписьЗаявителя
		|ИЗ
		|	ВТ КАК ВТ";
	
		Запрос.УстановитьПараметр("СельскийСовет",СельскийСовет);	
		Запрос.УстановитьПараметр("ТалоныТЧ",ТаблицаДляЗаполнения);	
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТалоныТалоныТЧ.НомерСтроки КАК НомерСтроки,
		|	ТалоныТалоныТЧ.Заявитель КАК Заявитель,
		|	ТалоныТалоныТЧ.АдресДомовладельца КАК АдресДомовладельца,
		|	ТалоныТалоныТЧ.Номер КАК Номер,
		|	ТалоныТалоныТЧ.ДатаВыдачи КАК ДатаВыдачи,
		|	ТалоныТалоныТЧ.Категория КАК Категория,
		|	ТалоныТалоныТЧ.Заявитель.ДатаРождения КАК ЗаявительДатаРождения,
		|	ТалоныТалоныТЧ.Заявитель.ПаспортСерия + ТалоныТалоныТЧ.Заявитель.ПаспортНомер КАК ПаспортныеДанные,
		|	ТалоныТалоныТЧ.Заявитель.ИНН КАК ЗаявительИНН,
		|	"""" КАК ДатаПолучения,
		|	"""" КАК ПодписьЗаявителя
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ТалоныТЧ КАК ТалоныТалоныТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.НомерСтроки КАК НомерСтроки,
		|	ВТ.Заявитель КАК Заявитель,
		|	ВТ.АдресДомовладельца КАК АдресДомовладельца,
		|	ВТ.Номер КАК Номер,
		|	ВТ.ДатаВыдачи КАК ДатаВыдачи,
		|	ВТ.Категория КАК Категория,
		|	ВТ.ЗаявительДатаРождения КАК ЗаявительДатаРождения,
		|	ВТ.ПаспортныеДанные КАК ПаспортныеДанные,
		|	ВТ.ЗаявительИНН КАК ЗаявительИНН,
		|	ВТ.ДатаПолучения КАК ДатаПолучения,
		|	ВТ.ПодписьЗаявителя КАК ПодписьЗаявителя
		|ИЗ
		|	ВТ КАК ВТ";
		Запрос.УстановитьПараметр("ТалоныТЧ",ТаблицаДляЗаполнения);
	КонецЕсли;	
		

	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(Шапка);
	Счетчик = 1;
	Пока Выборка.Следующий() Цикл
		Строка = Макет.ПолучитьОбласть("Строка");
		Строка.Параметры.НомерСтроки = Счетчик;
		Строка.Параметры.Заявитель = Выборка.Заявитель;
		Строка.Параметры.Номер = Выборка.Номер;
		Строка.Параметры.АдресДомовладельца = Выборка.АдресДомовладельца;
		Строка.Параметры.Категория = Выборка.Категория;
		Строка.Параметры.ДатаРождения = Формат(Выборка.ЗаявительДатаРождения,"ДФ=dd.MM.yyyy");
		Строка.Параметры.ПаспортныеДанные = Выборка.ПаспортныеДанные;
		Строка.Параметры.ИНН = Выборка.ЗаявительИНН;
		Строка.Параметры.ДатаВыдачи = Формат(Выборка.ДатаВыдачи,"ДФ=dd.MM.yyyy");

		ТабДок.Вывести(Строка);
		Счетчик = Счетчик+1;
		
		
	КонецЦикла;
	
	Подвал = Макет.ПолучитьОбласть("Подвал");	
	Подвал.Параметры.КоличествоТалонов = Счетчик-1;
	ТабДок.Вывести(Подвал);


	Возврат ТабДок;

КонецФункции

&НаКлиенте
Процедура ПечатьВедомости(Команда)
	ТабДок = ПечатьВедомостиНаСервере();
	ТабДок.Показать("Печать ведомости по сельским советам");

КонецПроцедуры
